<a href="https://colab.research.google.com/github/dylanthesweetpotato/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/Copy_of_LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-11-06 02:06:46--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.107.166
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.107.166|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  35.2MB/s    in 6.1s

2019-11-06 02:06:52 (32.2 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
##### Lets import what we will need first #####

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

aisles = pd.read_csv("/content/instacart_2017_05_01/aisles.csv")
departments = pd.read_csv("/content/instacart_2017_05_01/departments.csv")
order_prior = pd.read_csv("/content/instacart_2017_05_01/order_products__prior.csv")
order_train = pd.read_csv("/content/instacart_2017_05_01/order_products__train.csv")
orders = pd.read_csv("/content/instacart_2017_05_01/orders.csv")
products = pd.read_csv("/content/instacart_2017_05_01/products.csv")

In [0]:
## lets peak at all the heads

In [9]:
aisles.head()

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [10]:
departments.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [44]:
order_prior.head(30)

    order_id  product_id  add_to_cart_order  reordered
0          2       33120                  1          1
1          2       28985                  2          1
2          2        9327                  3          0
3          2       45918                  4          1
4          2       30035                  5          0
5          2       17794                  6          1
6          2       40141                  7          1
7          2        1819                  8          1
8          2       43668                  9          0
9          3       33754                  1          1
10         3       24838                  2          1
11         3       17704                  3          1
12         3       21903                  4          1
13         3       17668                  5          1
14         3       46667                  6          1
15         3       17461                  7          1
16         3       32665                  8          1
17         4       46842                  1          0
18         4       26434                  2          1
19         4       39758                  3          1
20         4       27761                  4          1
21         4       10054                  5          1
22         4       21351                  6          1
23         4       22598                  7          1
24         4       34862                  8          1
25         4       40285                  9          1
26         4       17616                 10          1
27         4       25146                 11          1
28         4       32645                 12          1
29         4       41276                 13          1

In [16]:
order_train.head(10)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1
5         1       13176                  6          0
6         1       47209                  7          0
7         1       22035                  8          1
8        36       39612                  1          0
9        36       19660                  2          1

In [14]:
orders.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [15]:
products.head()

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [27]:
## I will need product_id and product_name from products.   
## I will need add_to_cart_order and	reordered from order_products_train

## lets merge what we need

product2 = products[['product_id', 'product_name']]

order2 = order_train[['product_id', 'add_to_cart_order', 'reordered' ]]

productorders = pd.merge(product2, order2)

productorders.sample(4)

        product_id                product_name  add_to_cart_order  reordered
55838         2593     Organic Evaporated Milk                  1          1
812817       29118  French Vanilla Soy Creamer                  1          1
80359         3957      100% Raw Coconut Water                  5          1
735246       26751  Organic Tomato Basil Sauce                  1          1

In [33]:
#Banana
productorders[productorders['product_name']==('Banana')]['add_to_cart_order'].sum()

92870

In [34]:
#Bag of Organic Bananas
productorders[productorders['product_name']==('Bag of Organic Bananas')]['add_to_cart_order'].sum()

73739

In [35]:
#Organic Strawberries
productorders[productorders['product_name']==('Organic Strawberries')]['add_to_cart_order'].sum()

87338

In [36]:
#Organic Baby Spinach
productorders[productorders['product_name']==('Organic Baby Spinach')]['add_to_cart_order'].sum()

73237

In [37]:
#Organic Avocado
productorders[productorders['product_name']==('Organic Avocado')]['add_to_cart_order'].sum()

47549

In [38]:
#Organic Hass Avocado
productorders[productorders['product_name']==('Organic Hass Avocado')]['add_to_cart_order'].sum()

50853

In [39]:
#Large Lemon
productorders[productorders['product_name']==('Large Lemon')]['add_to_cart_order'].sum()

65595

In [40]:
#Strawberries
productorders[productorders['product_name']==('Strawberries')]['add_to_cart_order'].sum()

48324

In [41]:
#Limes
productorders[productorders['product_name']==('Limes')]['add_to_cart_order'].sum()

54180

In [42]:
#Organic Whole Milk
productorders[productorders['product_name']==('Organic Whole Milk')]['add_to_cart_order'].sum()

28087

In [46]:
productorders[productorders['product_name']==('All-Seasons Salt')]['add_to_cart_order'].sum()

63

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
flights = sns.load_dataset('flights')

In [49]:
#REPLICATE THE LESSON CODE
#create a simple table

myindex=['John Smith', 'Jane Doe', 'Mary Johnson']
mycolumns=['treatmenta', 'treatmentb']

table1 = pd.DataFrame(
          [[np.nan, 2],
           [16,11],
           [3,1]],
           columns=mycolumns,
           index =myindex
)

table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [50]:
table2=table1.T
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [51]:
#Table 1 Tidy
list(table1.columns)
table1.columns.tolist()

['treatmenta', 'treatmentb']

In [52]:
table1.index.tolist()

['John Smith', 'Jane Doe', 'Mary Johnson']

In [54]:
table1=table1.reset_index()
table1

   level_0         index  treatmenta  treatmentb
0        0    John Smith         NaN           2
1        1      Jane Doe        16.0          11
2        2  Mary Johnson         3.0           1

In [56]:
tidy = table1.melt(id_vars='index', value_vars =['treatmenta', 'treatmentb'])
tidy

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [58]:
#rename the columns
tidy = tidy.rename(columns={'index': 'name', 'variable':'trt', 'value': 'result'})
tidy

           name         trt  result
0    John Smith  treatmenta     NaN
1      Jane Doe  treatmenta    16.0
2  Mary Johnson  treatmenta     3.0
3    John Smith  treatmentb     2.0
4      Jane Doe  treatmentb    11.0
5  Mary Johnson  treatmentb     1.0

In [59]:
# shorten the trt values
tidy['trt'] = tidy['trt'].str.replace('treatment', '')
tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [60]:
##TABLE2 to TIDY 

list(table2.columns)
table2.columns.tolist()

['John Smith', 'Jane Doe', 'Mary Johnson']

In [61]:
table2.index.tolist()

['treatmenta', 'treatmentb']

In [62]:
table2=table2.reset_index()
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [82]:
tidy2 = table2.melt(id_vars='index', value_vars =['John Smith', 'Jane Doe', 'Mary Johnson'])
tidy2

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [83]:
## clean it up
tidy2 = tidy2.rename(columns={'index': 'trt', 'variable':'name', 'value': 'result'})
tidy2

          trt          name  result
0  treatmenta    John Smith     NaN
1  treatmentb    John Smith     2.0
2  treatmenta      Jane Doe    16.0
3  treatmentb      Jane Doe    11.0
4  treatmenta  Mary Johnson     3.0
5  treatmentb  Mary Johnson     1.0

In [84]:
tidy2['trt'] = tidy['trt'].str.replace('treatment', '')
tidy2

  trt          name  result
0   a    John Smith     NaN
1   a    John Smith     2.0
2   a      Jane Doe    16.0
3   b      Jane Doe    11.0
4   b  Mary Johnson     3.0
5   b  Mary Johnson     1.0

In [0]:
##Tidy to table 1

In [85]:
wide = tidy.pivot_table(index='name', columns = 'trt', values = 'result')
wide

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

In [87]:
## Tidy to table 2

wide2 = tidy.pivot_table(index = 'trt', columns = 'name', values = 'result')
wide2

name  Jane Doe  John Smith  Mary Johnson
trt
a         16.0         NaN           3.0
b         11.0         2.0           1.0

## create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [88]:
flights = sns.load_dataset('flights')

flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [89]:
wide3 = tidy.pivot_table(index='year', columns = 'month', values = 'passengers')
wide3

KeyError: ignored

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####